Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 120, 7)       0                                            
__________________________________________________________________________________________________
LSTM (LSTM)                     (None, 120)          61440       input_1[0][0]                    
__________________________________________________________________________________________________
dense1 (Dense)                  (None, 128)          15488       LSTM[0][0]                       
__________________________________________________________________________________________________
dense2 (Dense)                  (None, 128)          16512       dense1[0][0]                     
__________________________________________________________________________________________________
out_reg (Dense)                 (None, 2)            258         dense2[0][0]                     
__________________________________________________________________________________________________
out_cat (Dense)                 (None, 2)            258         dense2[0][0]                     
==================================================================================================
Total params: 93,956
Trainable params: 93,956
Non-trainable params: 0
__________________________________________________________________________________________________

-------------------------------------


Tickers included for training:

['ABBV', 'ABT', 'ALL', 'AMZN', 'BA', 'BABA', 'BAC', 'BMY', 'BP', 'BX', 'CSCO', 'CVX', 'DAL', 'DD', 'DIS', 'EBAY', 'FB', 'GE', 'GPRO', 'HD', 'INTC', 'JD', 'JPM', 'KHC', 'KO', 'KR', 'MRK', 'MSFT', 'MU', 'NWSA', 'ORCL', 'PEP', 'PFE', 'PM', 'PYPL', 'QCOM', 'QQQ', 'SBUX', 'SLB', 'T', 'TNA', 'TWLO', 'TWTR', 'TXN', 'TZA', 'USB', 'V', 'VER', 'VOD', 'VZ', 'WBA', 'WFC', 'WMT', 'WPM', 'WU', 'XOM', 'ZNGA']