Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 120, 18)      0                                            
__________________________________________________________________________________________________
conv1 (Conv1D)                  (None, 116, 64)      5824        input_1[0][0]                    
__________________________________________________________________________________________________
conv2 (Conv1D)                  (None, 112, 64)      20544       conv1[0][0]                      
__________________________________________________________________________________________________
conv3 (Conv1D)                  (None, 103, 64)      41024       conv2[0][0]                      
__________________________________________________________________________________________________
pool (MaxPooling1D)             (None, 99, 64)       0           conv3[0][0]                      
__________________________________________________________________________________________________
LSTM (LSTM)                     (None, 120)          66720       input_1[0][0]                    
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 6336)         0           pool[0][0]                       
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 6456)         0           LSTM[0][0]                       
                                                                 flatten_1[0][0]                  
__________________________________________________________________________________________________
dense1 (Dense)                  (None, 1000)         6457000     concatenate_1[0][0]              
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 1000)         0           dense1[0][0]                     
__________________________________________________________________________________________________
dense2 (Dense)                  (None, 500)          500500      dropout_1[0][0]                  
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 500)          0           dense2[0][0]                     
__________________________________________________________________________________________________
out_open (Dense)                (None, 20)           10020       dropout_2[0][0]                  
__________________________________________________________________________________________________
out_high (Dense)                (None, 20)           10020       dropout_2[0][0]                  
__________________________________________________________________________________________________
out_low (Dense)                 (None, 20)           10020       dropout_2[0][0]                  
__________________________________________________________________________________________________
out_close (Dense)               (None, 20)           10020       dropout_2[0][0]                  
__________________________________________________________________________________________________
out_vol (Dense)                 (None, 20)           10020       dropout_2[0][0]                  
__________________________________________________________________________________________________
out_cat (Dense)                 (None, 20)           10020       dropout_2[0][0]                  
==================================================================================================
Total params: 7,151,732
Trainable params: 7,151,732
Non-trainable params: 0
__________________________________________________________________________________________________

-------------------------------------


Tickers included for training:

['ABBV', 'ABT', 'ALL', 'AMZN', 'BA', 'BABA', 'BAC', 'BMY', 'BP', 'BX', 'CSCO', 'CVX', 'DAL', 'DD', 'DIS', 'EBAY', 'FB', 'GE', 'GPRO', 'HD', 'INTC', 'JD', 'JPM', 'KHC', 'KO', 'KR', 'MRK', 'MSFT', 'MU', 'NWSA', 'ORCL', 'PEP', 'PFE', 'PM', 'PYPL', 'QCOM', 'QQQ', 'SBUX', 'SLB', 'T', 'TNA', 'TWLO', 'TWTR', 'TXN', 'TZA', 'USB', 'V', 'VER', 'VOD', 'VZ', 'WBA', 'WFC', 'WMT', 'WPM', 'WU', 'XOM', 'ZNGA']